import { commentType } from "../../../Services/Types";

const commentSource: commentType[] = [
  {
    id: 0,
    text: "یکی از دلایلی که این دستگاه رو انتخاب کردم کنترل از راه دور این دستگاه بود دیگه نگرانی این رو ندارم که درخت ها از بی آبی خشک بشن",
    date: "98/04/10",
    shop: "دیجیکالا",
  },
  {
    id: 1,
    text: "من برای پمپ کف کش در ویلا استفاده کردم و رفت و آمد و هزینه من رو برای آبیاری حذف کرد",
    date: "98/04/09",
    shop: "دیجیکالا",
  },
  {
    id: 2,
    text: "قابلیت اتصال مستقیم به پمپ و وسایل با قدرت بالا رو هم داره",
    date: "99/02/17",
    shop: "ترب",
  },
  {
    id: 3,
    text: "محصول خوبی هست. استفاده از این دستگاه را به شما پیشنهاد میکنم",
    date: "99/06/08",
    shop: "دیجیکالا",
  },
  {
    id: 4,
    text: "پیشنهاد میکنم. عالی بود ، البته گذر زمان بهتر نشان میده",
    date: "01/02/11",
    shop: "وب سایت ویستو",
  },
  {
    id: 5,
    text: "دستگاه مثله یک کلید عمل می‌کنه.باید دید در آینده برای روشن کردن پکیج به من کمک می‌کنه",
    date: "01/10/29",
    shop: "دیجیکالا",
  },
  {
    id: 6,
    text: "برای آبیاری قطره ای استفاده کردم در مجموع خوبه",
    date: "01/03/30",
    shop: "دیجیکالا",
  },
  {
    id: 7,
    text: "ممنون از طراحی خوبتون. من به همه دارم پیشنهاد میکنم. واقعا دستتون درد نکنه",
    date: "01/01/15",
    shop: "وب سایت ویستو",
  },
];

export default commentSource;
