import { ShopDetailPageType, ShopItemsDataTypes } from "./Types";

export const smarsetData: ShopDetailPageType = {
  technical_text: `
    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
    `,
  app_data: {
    webapp_link: "https://app.visto.ir",
    android_link: "",
  },
  Q_A: [],
  images_array: [
    {
      url: "img100",
      index: true,
    },
    {
      url: "img101",
    },
    {
      url: "img102",
    },
  ],
  index_image_url: "image103",
};

export const mockDataForShopBody: ShopItemsDataTypes[] = [
  {
    id: 0,
    description: "شیر برقی 12 ولت",
    imageUrl: "",
    off: "",
    rawPrice: "350000",
  },
  {
    id: 1,
    description: "مرکز کنترل تک خروجی",
    imageUrl: "",
    off: "10",
    rawPrice: "995000",
  },
  {
    id: 2,
    description: "مرکز کنترل چهار خروجی",
    imageUrl: "",
    off: "",
    rawPrice: "1340000",
  },
  {
    id: 3,
    description: "مرکز کنترل پنج خروجی",
    imageUrl: "",
    off: "35",
    rawPrice: "1550000",
  },
];
