import { Typography } from "@mui/material";
import "./Style/style.css";

export default function PrefaceText() {
  return (
    <div className="preface-text-container">
      <Typography variant="body1">
        مرکز کنترل به اسامی مختلفی در بازار موجود است. کنترل از راه دور، کنترل
        پیامکی، کنترل اینترنتی، کنترل اس ام اسی، دستگاه کنترل پیامکی و... . وجه
        مشترک تمامی این محصولات، کنترل آنها میباشد. یعنی این محصولات، جهت کنترل
        وسایل به کار میروند. این محصولات معمولا به صورت یک وسیله الکترونیکی در
        بازار عرضه میشوند. گاها میتوان این دست محصولات را بوسیله گوشی موبایل
        کنترل نمود. بعضی از محصولات هم بصورت خودکار، از روی خود دستگاه قابل
        تنظیم میباشند. مانند تنظیم کردن یک تایمر دستی. شما تایمر را روی خود
        محصول تنظیم کرده و سپس دستگاه بصورت خودکار شروع به کار میکند. وقتی از
        مرکز کنترل پیامکی صحبت میکنیم، در واقع منظور روش ارتباطی با دستگاه
        میباشد. یعنی راه ارتباط با دستگاه، از طریق گوشی موبایل و با استفاده از
        پیامک میباشد. در این نوع محصولات، در واقع شما قادر خواهید بود وسایل برقی
        خانه خود را با گوشی موبایل خود و از راه دور کنترل کنید! از مهمترین
        کاربردهای مرکز کنترل پیامکی، میتوان به کنترل آبیاری فضای سبز از راه دور
        اشاره نمود.
      </Typography>
    </div>
  );
}
