import { Typography } from "@mui/material";
import "./Style/style.css";

export default function MainText() {
  return (
    <div className="solutions-maintext-container">
      <Typography variant="body1">
        از مهمترین مزایای مرکز کنترل پیامکی، صرفه جویی قابل توجهی در زمان
        میباشد. شما با این وسیله، بی نیاز از رفت و آمد به محل خود خواهید شد. به
        عنوان مثال فرض کنید یک باغچه دارید که در فاصله 50 کیلومتری شما قرار
        دارد. شما برای آبیاری فضای سبز باغچه باید هفته ای دو مرتبه به محل رفته و
        پمپ یا آب شهری را روشن کرده و برگردید. یا میتوانید در بهترین حالت یک فرد
        را استخدام کرده و در ازای مبلغی ماهیانه به فرد برای آبیاری فضای سبز خود
        اعتماد کنید.
      </Typography>
      <Typography variant="body1">
        با این دستگاه، شما میتوانید از منزل خود، بدون هیچگونه رفت و آمدی پمپ را
        روشن کنید. بعد از ارسال پیامک، دستگاه پمپ را روشن کرده و یک پیامک به شما
        ارسال میکند تا از روشن بودن پمپ مطمئن شوید. سپس بعد از هر مدت دلخواهی،
        پیامک خاموش را به دستگاه ارسال میکنید. دستگاه به محض دریافت پیامک خاموش،
        پمپ را خاموش کرده و پیامکی را به گوشی شما ارسال میکند. بدین ترتیب از
        زمان رفت و آمد و هزینه آن خلاص خواهید شد!
      </Typography>
      <Typography variant="body1">
        از دیگر مزایای مرکز کنترل پیامکی ویستو، رله های آمپر بالای آن میباشد.
        تقریبا در تمامی محصولات سعی شده تا رله های با ظرفیت بالا استفاده شود.
        این رله ها با نام رله کولری نیز در بازار یافت میشوند. این رله ها در
        محافظ های برق نیز استفاده میشوند. بزرگترین مزیت استفاده از این رله ها،
        عدم نیاز به کنتاکتور میباشد. شما با رله کولری معمولا میتوانید تا رنج 15
        تا 20 آمپر پیوسته، ظرفیت جریان دهی استفاده کنید. یعنی برای پمپ های تا 3
        اسب و 3 کیلووات و یا تقریبا جریان مصرفی یک خانه معمولی! در مجموع، عموم
        نیاز بازار نیز به همین اندازه میباشند و شما بدون نیاز به کنتاکتور یا رله
        اضافه، میتوانید پمپ آب یا لامپ حیات یا هر نوع وسیله خانگی را به دستگاه
        متصل کنید. علاوه بر هزینه کنتاکتور، از هزینه تابلو برق، مونتاژ و نگهداری
        تابلو نیز بی نیاز هستید.
      </Typography>
      <Typography variant="body1">
        مرکز کنترل پیامکی ویستو، به صورت چند مدیره میباشد. یعنی شما میتوانید
        همزمان از به عنوان مثال 5 سیم کارت مختلف به دستگاه متصل شده و محصولات
        خود را کنترل کنید. از دیگر مزایای آن میتوان به گزارش گیری و تنظیم برنامه
        خودکار اشاره کرد. یعنی شما میتوانید هر لحظه از وضعیت خروجی های خود گزارش
        دریافت کنید. گزارش یعنی کدام خروجی روشن و کدام خروجی در حال حاضر خاموش
        میباشد. تنظیم برنامه خودکار نیز، یعنی میتوانید فقط با یک پیامک، برنامه
        ای برای خروجی خود تنظیم کنید. به عنوان مثال، خروجی شماره یک هر 24 ساعت،
        یک ساعت روشن شود. پس از تنظیم برنامه، دستگاه به صورت خودکار شروع به کار
        میکند و سر ساعت خود روشن و خاموش میشود.
      </Typography>
    </div>
  );
}
