import { commentType } from "../../Services/Types";

const commentSource: commentType[] = [
  {
    id: 0,
    text: "یکی از دلایلی که این دستگاه رو انتخاب کردم کنترل از راه دور این دستگاه بود دیگه نگرانی این رو ندارم که درخت ها از بی آبی خشک بشن",
    date: "98/04/10",
  },
  {
    id: 1,
    text: "من برای پمپ کف کش در ویلا استفاده کردم و رفت و آمد و هزینه من رو برای آبیاری حذف کرد",
    date: "98/04/09",
  },
  {
    id: 2,
    text: "قابلیت اتصال مستقیم به پمپ و وسایل با قدرت بالا رو هم داره",
    date: "17/02/99",
  },
  {
    id: 3,
    text: "محصول خوبی هست. استفاده از این دستگاه را به شما پیشنهاد میکنم",
    date: "06/08/99",
  },
  {
    id: 4,
    text: "پیشنهاد میکنم. عالی بود ، البته گذر زمان بهتر نشان میده",
    date: "11/02/00",
  },
  {
    id: 5,
    text: "دستگاه مثله یک کلید عمل می‌کنه.باید دید در آینده برای روشن کردن پکیج به من کمک می‌کنه",
    date: "29/10/00",
  },
  {
    id: 6,
    text: "برای آبیاری قطره ای استفاده کردم در مجموع خوبه",
    date: "30/03/01",
  },
];

export default commentSource;
